masarray/arstack61850/embedded/esp32p4_smv_injector/sdkconfig.defaults
# ARStack ESP32-P4-ETH SMV Injector defaults.
CONFIG_IDF_TARGET="esp32p4"
# The proven P0 hardware uses ESP32-P4 pre-v3 silicon (bench: rev v1.3).
# ESP-IDF 5.5 defaults to >=v3 silicon unless this selector is enabled.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_AR_SMV_LIVE_TX=y
CONFIG_AR_SMV_P2_REALTIME_50HZ=y
CONFIG_AR_SMV_CANONICAL_VLAN=y
CONFIG_AR_SMV_BROADCAST_MIRROR=y
# CONFIG_AR_SMV_DIAGNOSTIC_PROBES is not set
CONFIG_AR_SMV_CURRENT_RMS_MA=1000
CONFIG_AR_SMV_VOLTAGE_RMS_MV=57740

# v0.1.1 production timing companion. LAB_SOURCE preserves the existing
# ARIEC61850/ARSVIN lab behavior while using ESP32-P4 IEEE1588 HW timestamps.
CONFIG_AR_PTP_LAB_TX=y
CONFIG_AR_PTP_OPERATING_ROLE=0
CONFIG_AR_PTP_DOMAIN=0
CONFIG_AR_PTP_TRANSPORT_SPECIFIC=0
CONFIG_AR_PTP_PORT_NUMBER=1
# CONFIG_AR_PTP_VLAN is not set
CONFIG_AR_PTP_ANNOUNCE_INTERVAL_MS=1000
CONFIG_AR_PTP_SYNC_INTERVAL_MS=250
CONFIG_AR_PTP_RESPOND_PDELAY=y
CONFIG_AR_PTP_PDELAY_REQUEST_INTERVAL_MS=1000
CONFIG_AR_PTP_PRIORITY1=128
CONFIG_AR_PTP_PRIORITY2=128
CONFIG_AR_PTP_CLOCK_CLASS=248
CONFIG_AR_PTP_CLOCK_ACCURACY=254
CONFIG_AR_PTP_OFFSET_SCALED_LOG_VARIANCE=65535
CONFIG_AR_PTP_TIME_SOURCE=160
CONFIG_AR_PTP_CURRENT_UTC_OFFSET=37
CONFIG_AR_PTP_MAX_PATH_DELAY_NS=5000000
CONFIG_AR_PTP_MAX_PATH_JITTER_NS=100000
CONFIG_AR_PTP_LOCK_OFFSET_NS=2000
CONFIG_AR_PTP_UNLOCK_OFFSET_NS=20000
CONFIG_AR_PTP_PHASE_STEP_THRESHOLD_NS=1000000
CONFIG_AR_PTP_LOCK_REQUIRED_SAMPLES=8
CONFIG_AR_PTP_SYNC_TIMEOUT_MS=1000
CONFIG_AR_PTP_HOLDOVER_TIMEOUT_MS=5000
CONFIG_AR_PTP_MAX_FREQ_ADJ_PPB=100000
